In [4]:
import os

import mysql.connector
# from mysql import connector
from dotenv import load_dotenv
import pandas as pd

In [5]:
load_dotenv()

#print(os.getenv('USER'))
user = os.getenv('USER')
password = os.getenv('PASSWORD')
host = os.getenv('HOST')
database = 'swiftmarket'

In [6]:
password

'abc@123'

In [7]:
connection = mysql.connector.connect(user=user,
                                     password=password,
                                     host=host,
                                     database=database )

cursor = connection.cursor()

In [8]:
connection.is_connected()

True

In [9]:
query = '''show tables'''
cursor.execute(query)
rows = cursor.fetchall()
for row in rows:
    print(row)

('categories',)
('customers',)
('employees',)
('salesdata',)
('subcategories',)
('suppliers',)

In [10]:
query = '''select * from salesdata limit 5;'''
cursor.execute(query)
rows = cursor.fetchall()
for row in rows:
    print(row)

(23000, 'C-2023-100-12', 6002, 1100, datetime.date(2023, 5, 2), 2, Decimal('176432.00'))
(23001, 'C-2023-100-141', 6029, 1115, datetime.date(2023, 12, 26), 2, Decimal('47172.00'))
(23002, 'C-2023-100-86', 6029, 1035, datetime.date(2023, 3, 26), 2, Decimal('47172.00'))
(23003, 'C-2023-100-72', 6006, 1016, datetime.date(2023, 8, 1), 2, Decimal('117644.00'))
(23004, 'C-2023-100-142', 6030, 1067, datetime.date(2023, 3, 6), 5, Decimal('336560.00'))

In [11]:
cursor.column_names

('SaleID',
 'CustomerID',
 'SubcatID',
 'EmployeeID',
 'SaleDate',
 'Quantity',
 'TotalPrice')

In [12]:
pd.DataFrame(data=rows, columns=cursor.column_names)

,SaleID,CustomerID,SubcatID,EmployeeID,SaleDate,Quantity,TotalPrice
0,23000,C-2023-100-12,6002,1100,2023-05-02,2,176432.00
1,23001,C-2023-100-141,6029,1115,2023-12-26,2,47172.00
2,23002,C-2023-100-86,6029,1035,2023-03-26,2,47172.00
3,23003,C-2023-100-72,6006,1016,2023-08-01,2,117644.00
4,23004,C-2023-100-142,6030,1067,2023-03-06,5,336560.00

In [13]:
def read_query(query):
    cursor.execute(query)
    rows = cursor.fetchall()
    return pd.DataFrame(data=rows, columns=cursor.column_names)

In [14]:
query = '''select * from salesdata limit 5;'''
read_query(query)

,SaleID,CustomerID,SubcatID,EmployeeID,SaleDate,Quantity,TotalPrice
0,23000,C-2023-100-12,6002,1100,2023-05-02,2,176432.00
1,23001,C-2023-100-141,6029,1115,2023-12-26,2,47172.00
2,23002,C-2023-100-86,6029,1035,2023-03-26,2,47172.00
3,23003,C-2023-100-72,6006,1016,2023-08-01,2,117644.00
4,23004,C-2023-100-142,6030,1067,2023-03-06,5,336560.00

In [16]:
query = '''select * from categories limit 5;'''
read_query(query)

   CategoryID                     CategoryName
0      500100          Electronics and Gadgets
1      500101      Home and Kitchen Appliances
2      500102     Outdoor and Sports Equipment
3      500103     Health and Wellness Products
4      500104  Books and Educational Materials

In [15]:
<h1 style="color:"

SyntaxError: invalid syntax (3230146541.py, line 1)

In [ ]:
query = """select 
    monthname(s.saledate) as monthnames,
    e.firstname,
    sum(s.totalprice) as totalsales
from salesdata s
    join employees e
    on s.employees e 
where monthname(saledate)='Janurary'
group by monthname(s.saledate), e.firstname
order by totalsales desc 
limit 10;"""
df = read_query(query=query)

NameError: name 'read_query' is not defined

In [ ]:
df

NameError: name 'df' is not defined